<style  type="text/css">
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

loud {
    font-size: 20pt;
    }

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Spring 2024, Sections 002/V02
</span>
</center></b>
<br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Midterm
</span>
</center></i>

# Introduction

This notebook contains the midterm. **Both Programming and Nonprogramming tracks should complete this.** To ensure everything runs as expected, work on this notebook in Jupyter.

- You may post **privately** on Edstem or attend OH for clarification
    - TAs will not be providing hints

Submission instructions:

* You will submit **PDF and ZIP files** for this assignment. Gradescope will have two separate assignments for these.
* For the PDF:
    * The most reliable way to save as PDF is to go to your browser's menu bar and click `File -> Print`. Switch the orientation to landscape mode, and hit save.
    * **MAKE SURE ALL YOUR WORK (CODE AND SCREENSHOTS) IS VISIBLE ON THE PDF. YOU WILL NOT GET CREDIT IF ANYTHING IS CUT OFF.** Reach out for troubleshooting.
* For the ZIP:
    * Zip a folder containing this notebook and any screenshots.
* Further submission instructions may be posted on Edstem.

<hr style="height:2px;">

# Setup

In [677]:
%load_ext sql
%sql mysql+pymysql://root:dbuserdbuser@localhost

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [678]:
import pandas
from sqlalchemy import create_engine
engine = create_engine("mysql+pymysql://root:dbuserdbuser@localhost")

<hr style="height:2px;">

# Written

- You may use lecture notes, slides, and the textbook
- You may use external resources, but you must cite your sources
- As usual, keep things short

## W1

Briefly explain structured data, semi-structured data, and unstructured data. Give an example of each type of data.

Structured data is data that has been organized into a pre-defined and specific model, typically using a schema or pre-defined format. It consists of discrete data types such as numbers, short text, and dates. Structured data has a definition of what it should look like before it gets stored/processed. Example: relational databases (such as the ones managed by SQL)

Semi-structured data is data that is not formatted into a rigid schema like structured data but still has some organizational properties, such as tags or keys. It may contain nested or hierarchical elements. Entities in the same group may or may not have the same attributes or properties. Example: JSON

Unstructured data is data that does not adhere to any specific schema. It does not fit neatly into a predefined format. Unstructured data comes in many forms, that all share the common property of lacking an identifiable structure. Example: Word documents, audio recordings

Sources: 
- https://www.geeksforgeeks.org/what-is-structured-data/
- https://aws.amazon.com/compare/the-difference-between-structured-data-and-unstructured-data/#:~:text=Structured%20data%20is%20data%20that,files%20and%20large%20text%20documents.
- https://www.geeksforgeeks.org/what-is-semi-structured-data/
- https://www.geeksforgeeks.org/what-is-unstructured-data/

## W2

Codd's 0th rule states:

    For any system that is advertised as, or claimed to be, a relational database management system, that system must be able to manage databases entirely through its relational capabilities.
    
Briefly explain and give examples of how the rule applied to:

1. Metadata
2. Security

1. Metadata

Metadata describes data that provides information about the organization and properties of other data. Codd's 0th Rule means that for RDBMSs, metadata is stored in tables within the database itself, and users can query and manipulate this data (for example using SQL). 

Examples: Users can query the system catalog tables to retrieve metadata about the database schema. The SQL query "describe classicmodels.customers;" produces a table with information about the attributes in the table *customers*, including the attributes' data types and key-types.

Users can also manipulate metadata using SQL DDL statements. The SQL statement: 
"use classicmodels;
 CREATE TABLE vendors(
    vendorID varchar(10) PRIMARY KEY,
    vendorLastName varchar(25),
    vendorFirstName varchar(25)
);"
creates a new table called *vendors* in the **classicmodels** schema. It also accordingly updates the metadata in the **classicmodels** schema (such as updating information_schema.TABLES to include the new vendor table).

2. Security

Security describes the system of controlling access to the database and ensuring data confidentiality, availability, and integrity. Codd's 0th Rule means that a RDBMS must execute its security measures using its relational capabilities; using tables, it must be able to define user roles, permissions, and access. For example, authorization (what a user is allowed to do to data) can be assigned to users on different parts/tables within the database through SQL statements. The statement "**grant delete on** *department* to *John*;" allows the user John to delete tuples from the relation *department*. If a user is not authorized for a query/update, when the user attempts to carry it out SQL will reject the query/update. User authentication is also carried out through a database's relational capabilities. In a hidden metadata table, user IDs and their passwords are stored securely using a hash function; when a user tries to login, the user's inputted password is hashed and compared with the stored hash in the database. If the hashes match, the user is authenticated and allowed access; if they do not match, the user is denied access to the database. 

From these examples we can see that authorization and authentication, among other security procedures, are enforced through a database's relational capabilities.

Source:
- https://www.linkedin.com/advice/0/how-do-you-use-hashing-implement-password-authentication#:~:text=2%20Hashing%20for%20authentication,-To%20use%20hashing&text=If%20the%20hashes%20match%2C%20you,of%20password%20theft%20or%20leakage.
- https://auth0.com/blog/hashing-passwords-one-way-road-to-security/

## W3

Codd's 6th rule states:

    All views that are theoretically updatable are also updatable by the system.
    
Using the following table definition, use SQL (`create view`) to define

    1. Two views of the table that are not possible to update
    2. One view that is possible to update
    
You do not need to execute the statements. We are focusing on your understanding.

```
create table student
(
    social_security_no char(9) not null primary key,
    last_name varchar(64) null,
    first_name varchar(64) null,
    enrollment_year year null,
    total_credits int null
);
```

Two views that are not possible to update:
```
CREATE VIEW first_year_student_names AS
SELECT last_name, first_name
FROM students
WHERE enrollment_year = 2023;
```
This view is not possible because there is an attribute that is not listed in the **select** clause that cannot be set to null. The attribute *social_security_number* is not in the **select** clause, but it has a **not null** constraint and is the primary key; therefore the view does not satisfy the constraints required for a view to be update-able.
```
CREATE VIEW students_by_year AS
SELECT *
FROM students
GROUP BY enrollment_year;
```
This view is not possible to update because the query has a **group by** clause.


One view that is possible to update: 
```
CREATE VIEW first_year_students AS
SELECT *
FROM students
WHERE enrollment_year = 2023;
```

## W4

The Columbia University directory of courses uses `20241COMS4111W002` for this sections "key".

1. Is this key atomic? Explain.
2. Explain why having non-atomic keys creates problems for indexes.

1. An atomic domain is a domain in which the values are indivisible units and cannot be reduced to smaller elements. Therefore, this key is not atomic since it can be broken down into multiple subparts including year, department, course ID, and section. 
2. Non-atomic keys create problems for indexes because they require greater consideration and maintenance to ensure their integrity and effectiveness. Since non-atomic keys are made up of sub-attributes, if any individual attribute within a non-atomic key is updated, then there must be subsequent updates and adjustments to the associated index entries. This causes additional overhead cost compared to updates on atomic keys. Non-atomic keys essentially decrease the performance and effectiveness of indexes since indexes are meant to speed up query execution, and non-atomic keys can cause slower index traversal and lookup operations (as well as an increase in the storage needed for the indexes).

## W5

Briefly explain the following concepts:

1. Natural join
2. Equi-join
3. Theta join
4. Left join
5. Right join
6. Outer join
7. Inner join

1. Natural join works by looking for columns in both tables that have the same name, then combining the tables and keeping rows with matching values in those common columns. Natural join looks at the Cartesian product of two relations, then creates a new table containing only those tuples that have the same value on those shared attributes. Natural join does not repeat those shared attributes (it only keeps one of the common columns).

2. Equi-join combines two relations based on the equality of values in certain columns (specified in the join condition). It returns a new table with only the rows where the values of the specifed columns from the two relations are equal. Equi-join is a specific form of inner join in which the join condition must be an equality.

3. Theta join combines two relations based on a specified join condition that is an arbitrary predicate not limited to equality. It returns a new table with only those tuples where the values of the specified columns fulfill the join condition. Theta join is a more general form of inner join.

4. Left join preserves all the rows from the left table (first table in the join clause). It creates a new table containing all the rows from the left table combined with the matching rows from the right table (second table in the join clause), and if there is no matching row in the right table, NULL values are included for the columns of the right table.

5. Right join preserves all the rows from the right table (second table in the join clause). It creates a new table containing all the rows from the right table combined with the matching rows from the left table (first table in the join clause), and if there is no matching row in the left table, NULL values are included for the columns of the left table.

6. Outer join creates a new table that contains both the rows that matched and those that did not match; it preserves all tuples. Outer join combines and keeps rows with matching values in the columns specified by the join condition. If a value from one table's column does not have a matching value in the other table's specified column, NULL values are included for the columns of the table without a match.

7. Inner join creates a new table by combining rows from tables where both rows together satisfy the join condition. It excludes any rows where the join condition evaluates to false. When the join condition is equality, inner join produces the intersection of the two tables based on the specified columns.

Sources: 
https://www.sqlshack.com/a-step-by-step-walkthrough-of-sql-inner-join/
https://www.sqlshack.com/sql-outer-join-overview-and-examples/
https://www.w3schools.com/sql/sql_join_inner.asp

## W6

The _Classic Models_ database has several foreign key constraints. For instance, _orderdetails.orderNumber_ references _orders.orderNumber_.

1. Briefly explain the concept of _cascading actions_ relative to foreign keys.
2. How could cascading actions be helpful for the above foreign key relationship?

1. Cascading actions relative to foreign keys means that when creating a foreign key, we can use the action **cascade** (**on delete cascade** or **on update cascade**); then, if a delete or update on the referenced relation causes a violation of the foreign key constraint, instead of rejecting the action, the system will alter the tuple in the referencing relation to ensure the constraint is fulfilled.
2. If the foreign key clause of *orderdetails* includes the cascade actions **on delete cascade** and **on update cascade**, this is helpful because then if we want to update a tuple's orderNumber or delete a tuple with a certain orderNumber, we only have to do so in the relation *orders*. Due to cascading, this change will also be carried out on the tuple with that same orderNumber in the table *orderdetails*. Because we only have to run the update/delete statement on one table instead of both, we reduce the possibility of error in executing the action.

## W7

Give two reasons for using an associative entity to implement a relationship instead of a foreign key.

1. Many to Many relationships: Associative entities are useful for representing many-to-many relationships. By applying an associative entity, we can model the relationship through a separate entity that has its own attributes and relationships to the original entities. This is a better option than using a foreign key because it avoids duplicating data and convoluted foreign key setups. Associate entities are cleaner and more accurate than foreign keys, which may not capture the full complexity of a many-to-many relationship.
2. Additional attributes/properties on the relationship: Foreign keys only describe the relationship between entities concerning one single attribute. When the relationship itself has properties, an associate entity is beneficial for its ability to include these additional attributes. Associative entities can ensure that all relevant information about the relationship is captured.

## W8

Briefly explain how SQL is closed under its operations. Give a simple query that takes advantage of this.

Previously, we discussed relational algebra; there, closure under the operators meant that applying any of the relational algebra operators on relations will always result in another relation. SQL is similarly closed under its operations. Performing operations on SQL objects using SQL commands will always result in another SQL object--a table or query result that can be further manipulated using SQL. This means the result of one SQL operation can be used as the input for another. 

Simple example query:

`select productCode as popularProducts 
from
(
    select * from orderDetails where quantityOrdered>50
)
`

Source: https://www.oreilly.com/library/view/sql-and-relational/9781449319724/ch06s02.html

## W9

Briefly explain the differences between:

1. Database stored procedures
2. Database functions
3. Database triggers

Stored procedures and functions are sets of SQL statements that are stored in the database and can be called by queries, other procedures, and other functions. 
Stored procedures can contain control-flow logic like loops or conditional statements, and they can modify database objects. Functions can return a single value or table based on input parameters and are used for computations or transformations.
Triggers are statement that are executed automatically by the system as a side effect of a modification to the database.

Source: https://www.shiksha.com/online-courses/articles/stored-procedure-vs-function-what-are-the-differences/#:~:text=procedure%20vs%20Function-,Stored%20procedures%20take%20no%20parameters%2C%20can%20modify%20database%20objects%2C%20and,cannot%20be%20called%20from%20functions.

## W10

List three benefits/use cases for defining views.

1. Security - Views can be used to restrict access to certain columns or rows of a table based on user roles or permissions. By creating a view and granting access solely to the view rather than the underlying tables, the user will only be able to query/interact with the data you have specifically put in the view; this can enforce security and protects the data from tampering.
2. Data abstraction - Defining views is beneficial for creating a simplified perspective. Instead of having to deal with a multitude of different tables each with their specific details and relationships, we can create a view that provides a consolidated representation of the data that is easier to work and hides the underlying complexity.
3. Efficiency - Views are useful when we know we will have to run a specific query multiple times (especially if it is very complex). Instead of having to write the query many times, we can simply define a view then query that.

Source: https://stackoverflow.com/questions/2680207/what-is-a-good-reason-to-use-sql-views

<hr style="height:2px;">

# Relational Algebra

- Use the [Relax calculator](https://dbis-uibk.github.io/relax/calc/gist/4f7866c17624ca9dfa85ed2482078be8/relax-silberschatz-english.txt/0) for these questions.
- For each question, you need to show your algebra statement and a screenshot of your tree and output.
    - **For your screenshot, make sure the entire tree and output are shown.** You may need to zoom out.
- The suggestions on which relations to use are hints, not requirements.

## R1

- Write a relational algebra statement that produces a relation showing **teachers that taught sections in buildings that didn't match their department's building**.
    - A section is identified by `(course_id, sec_id, semester, year)`.
- Your output should have the following columns (names should match exactly; there should be no prefixes):
    - `instructor_name`
    - `instructor_dept`
    - `course_id`
    - `sec_id`
    - `semester`
    - `year`
    - `course_building`
    - `dept_building`
- You should use the `teaches`, `section`, `instructor`, and `department` relations.


- As an example, one row you should get is

| instructor_name | instructor_dept | course_id | sec_id | semester | year | course_building | dept_building |
|-----------------|-----------------|-----------|--------|----------|------|-----------------|---------------|
| 'Srinivasan'    | 'Comp. Sci.'    | 'CS-101'  | 1      | 'Fall'   | 2009 | 'Packard'       | 'Taylor'      |

- Srinivasan taught CS-101, section 1 in Fall of 2009 in the Packard building. However, Srinivasan is in the CS department, whose building is Taylor.

Algebra statement:

```
π instructor_name←instructor.name,
	instructor_dept←instructor.dept_name,
	course_id←section.course_id,
	sec_id←section.sec_id,
	semester←section.semester,
	year←section.year,
	course_building←section.building,
	dept_building←department.building
	(σdepartment.building ≠ section.building
		((teaches ⨝ 
				teaches.course_id=section.course_id
				∧teaches.sec_id=section.sec_id
				∧teaches.semester=section.semester
				∧teaches.year=section.year
		(section)) ⨝
				teaches.ID=instructor.ID
		(instructor ⨝
				instructor.dept_name=department.dept_name
		(department))))
```

Execution:

| <img src="R1.jpg"> |
| :---: |
| __R1 Execution Result__|

## R2

- Some students don't have instructor advisors. Some instructors don't have student advisees.
- Write a relational algebra statement that produces a relation showing **valid pairing between unadvised students and instructors with no advisees**.
    - A pairing is valid only if the student's department and instructor's department match.
- Your output should have the following columns (names should match exactly; there should be no prefixes):
    - `instructor_name`
    - `student_name`
    - `dept_name`
- You should use the `advisor`, `student`, and `instructor` relations.
- **You may only use the following operators:** π, σ, =, ≠, ∧ (and), ∨ (or), ρ, ←, ⨝, ⟕, ⟖, ⟗
    - You may not need to use all of them.
    - Notably, you may **not** use anti-join or set difference.
    

- As an example, one row you should get is

| instructor_name | student_name | dept_name |
|-----------------|--------------|-----------|
| 'El Said'       | 'Brandt'     | 'History' |

- El Said has no advisees, and Brandt has no advisor. They are both in the history department.
- The same instructor may show up multiple times, but the student should be different each time. Similarly, the same student may show up multiple times, but the instructor should be different each time.

Algebra statement:

```
π instructor_name←instructor.name,
	student_name←student.name,
	dept_name←student.dept_name
			(σstudent.dept_name=instructor.dept_name
((πstudent.name,
	student.dept_name,
	advisor.i_id
	(σadvisor.i_id=null 
			(ρ s_id←ID student⟕ advisor)))
		⨝ advisor.i_id=advisor.s_id			
(πinstructor.name,
	instructor.dept_name,
	advisor.s_id
	(σadvisor.s_id=null 
			(ρ i_id←ID instructor⟕ advisor)))))
```

Execution:

| <img src="./R2.1.jpg"><img src="./R2.2.jpg"> |
| :---: |
| __R2 Execution Result__|

## R3

- Consider `new_section`, defined as:

```
new_section = π course_id, sec_id, building, room_number, time_slot_id (section)
```

- `new_section` contains sections, their time assignments, and room assignments independent of year and semester.
    - For this question, you can assume all the sections listed in `new_section` occur in the same year and semester.
- Write a relational algebra statement that produces a relation showing **conflicting sections**.
    - Two sections conflict if they have the same `(building, room_number, time_slot_id)`.
- Your output should have the following columns (names should match exactly; there should be no prefixes):
    - `first_course_id`
    - `first_sec_id`
    - `second_course_id`
    - `second_sec_id`
    - `building`
    - `room_number`
    - `time_slot_id`
- Your output cannot include courses and sections that conflict with themselves, or have two rows that show the same conflict.


- Good news: I'm going to give you the correct output!

| first_course_id | first_sec_id | second_course_id | second_sec_id | building | room_number | time_slot_id |
|-----------------|--------------|------------------|---------------|----------|-------------|--------------|
| 'CS-190'        | 2            | 'CS-347'         | 1             | 'Taylor' | 3128        | 'A'          |
| 'CS-319'        | 2            | 'EE-181'         | 1             | 'Taylor' | 3128        | 'C'          |

- Bad news: Your output must match mine **exactly**. The order of `first_course_id` and `second_course_id` cannot be switched.
    - Hint: You can do string comparisons in Relax using the inequality operators.

Algebra statement:

```
new_section = π course_id, sec_id, building, room_number, time_slot_id (section)

π first_course_id←section.course_id,
	first_sec_id←section.sec_id,
	second_course_id←c,
	second_sec_id←s,
	building←b,
	room_number←r,
	time_slot_id←t
(
σ section.building=b 
	∧section.room_number=r
	∧section.time_slot_id = t
	∧section.course_id<c
(
section ⨯ 
(π c←course_id,
	 s←sec_id,
	 b←building,
	 r←room_number,
	 t←time_slot_id (new_section))
) 
- 
σ section.building=b 
	∧section.room_number=r
	∧section.time_slot_id = t
	∧section.course_id=c
	∧section.sec_id=s
(
section ⨯ 
(π c←course_id,
	 s←sec_id,
	 b←building,
	 r←room_number,
	 t←time_slot_id (new_section))
))
```

Execution:

| <img src="./R3.jpg"> |
| :---: |
| __R3 Execution Result__|

<hr style="height:2px;">

# ER Modeling

## Definition to Model

- You're in charge of creating a model for a new music app, Dotify.


- The model has the following entities:
    1. `Artist` has the properties:
        - artist_id (primary key)
        - name
        - description
        - date_joined
    2. `Album` has the properties:
        - album_id (primary key)
        - name
        - release_date
    3. `Song` has the properties:
        - song_id (primary key)
        - title
        - song_length
        - number_of_plays
    4. `User` has the properties:
        - user_id (primary key)
        - name
        - bio
        - date_joined
    5. `Review` has the properties:
        - review_id (primary key)
        - number_of_stars
        - review_text
    6. `Playlist` has the properties:
        - playlist_id (primary key)
        - name
        - description
        
        
- The model has the following relationships:
    1. `Artist-Album`: An artist can have any number of albums. An album belongs to one artist.
    2. `Album-Song`: An album can have at least one song. A song is on exactly one album.
    3. `Artist-Song`: An artist can have any number of songs. A song has at least one artist.
    4. `Album-Review`: An album can have any number of reviews. A review is associated with exactly one album.
    5. `User-Review`: A user can write any number of reviews. A review is associated with exactly one user.
    6. `User-Playlist`: A user can have any number of playlists. A playlist belongs to exactly one user.
    7. `Song-Playlist`: A song can be on any number of playlists. A playlist contains at least one song.
    
    
- Other requirements:
    1. You may **only** use the [four Crow's Foot](https://www.inf.usi.ch/faculty/soule/teaching/2014-spring/2014-03-07/images/crows-feet-notation.png) notations shown in class.
    2. A user can leave at most one review per album (you don't need to represent this in your diagram). However, reviews can change over time. Your model must support the ability to keep track of a user's current and previous reviews for an album as well as the dates for the reviews.
    3. Playlists can change over time. Your model must support the ability to keep track of current songs in a playlist as well as which songs were on a playlist for what date ranges.
    4. You may not directly link many-to-many relationships. You must use an associative entity.
    5. You may (and should) add attributes to the entities and create new entities to fulfill the requirements. **Do not forget about foreign keys.**
    6. You may add notes to explain any reasonable assumptions you make, either on the Lucidchart or below.
        - It would be beneficial, for instance, to document how you implemented requirements 2 and 3.

_Assumptions and Documentation_
- For requirement 3: my model supports the ability to keep track of which songs were on a playlist for what date ranges through the attributes date_added and date_removed in the associative entity *Song_on_Playlist*. date_added records the date the song was put on the playlist (must be not-NULL), and date_removed records the date the song was removed from the playlist. If the song has not been removed from the playlist, the value for date_removed is NULL. The date range during which a song was on a playlist can be found by selecting the columns date_added and date_removed for a certain song on a playlist (which can be identified by song_id and playlist_id).

Assumption: We assume that a song can be associated with a playlist at most once. You cannot add the same song (same song_id) to a playlist multiple times. This means that the tuples of *Song_on_Playlist* can be identified uniquely by the composite primary key of song_id and playlist_id.

- For requirement 3: my model supports the ability to keep track of current songs in a playlist through the associative entity *Song_on_Playlist*. For a given *Playlist*, to find all current songs on the playlist we could simply select all rows from *Song_on_Playlist* that have the same value for playlist_id as the given *Playlist* and a NULL value for date_removed (since NULL for date_removed means the song is still currently on the playlist). 

Assumption: We assume that one review can be written per day at maximum (most recent review depends on date).
Assumption: We assume that if a user's review for an album "changes over time", this updated review is stored as its own new entity. 
- For requirement 2: my model supports the ability to track the dates for the reviews through the attribute I added, date_of_review. This attribute contains the date on which the review was made. 
- For requirement 2, my model also supports the ability to keep track of a user's current and previous reviews for an album through the date_of_review. To view the history of a user's current and previous reviews for an album, you can query *Review* and filter the rows based on the desired user_id and album_id. You can also retrieve the current/latest review for a specific user and album by selecting the first row for that user and album ordered by date_of_review.

Diagram:

| <img src="./ER1.jpg"> |
| :---: |
| __Definition to Model ER Diagram__|

## Model to DDL

- This question tests your ability to convert an ER diagram to DDL.
- Given the ER diagram below, write `create table` statements to implement the model.
    - You should choose appropriate data types, nullness, etc.
    - **You are required to implement the assumptions shown in the diagram.** You can document your other assumptions.
    - You don't need to execute your statements. You also don't need to worry about details like creating/using a database.
    
| <img src="./model-to-sql.png"> |
| :---: |
| __Model to DDL ER Diagram__|

Answer:


_Assumptions and Documentation_
- All passport_no values are 9 characters long
- I assume a *Passenger* or *Crew_Member* is not valid unless they have a passport_no; passport_no must be non-Null
- I make the assumption all *Passenger* passenger_id values are always 12 characters long
- I make the assumption all *Airline* airline_id values are always 15 characters long
- I make the assumption all *Flight* flight_no values are always 9 characters long
- I make the assumption all *Airport* airport_id values are always 9 characters long
- I make the assumption that *Airplane* airplane_tail_no values can be a mix of characters (not just numbers)
- *Flight* seat_no values are a combination of a number and letter, just like in real life (ex. 28D)
- I choose not to use **cascade** actions when creating foreign keys. I do not want the system to change any tuples in tables I am not directly modifying; rather, would prefer to have an action rejected so I can directly identify and alter the necessary tables/tuples.
- When the requirements say "[...iata/...icao] is always [2/3/4] characters" I assume this means these attributes cannot be NULL
- When the requirements say an attribute is a boolean, I assume this does not mean the boolean must be not-Null; it only means the data type must be boolean
- I assume a *Crew_Member* must have a first_name, last_name, and birthdate; those attributes must be not-Null
- Note, FKs must have the same data type as the attributes they reference



```

create table Passenger (
    passenger_id char(12) not null,
    first_name varchar(25),
    last_name varchar(25),
    birthdate DATE,
    country_of_origin varchar(100),
    passport_no char(9) not null,
    primary key (passenger_id)
);

create table Airline (
    airline_id char(15) not null,
    airline_iata char(2) not null,
    airline_icao char(3) not null,
    airline_name varchar(100),
    active boolean,
    airline_country varchar(100),
    primary key (airline_id)
);

create table Airplane (
    airplane_tail_no varchar (15) not null,
    airplane_manufacturer varchar(100),
    airplane_model varchar(50),
    airplane_country_of_origin varchar(100),
    capacity int,
    airplane_owner_airline_id char(15) not null,
    primary key(airplane_tail_no),
    foreign key (airplane_owner_airline_id) references Airline(airline_id)
);

create table Airport (
    airport_id char(9) not null,
    airport_iata char(3) not null,
    airport_icao char(4) not null,
    airport_name varchar (100),
    airport_country varchar(100),
    primary key (airport_id)
);

create table Flight (
    airline_id      char(15)    not null,
    flight_no       char(9)     not null,
    departure_airport   char(9) not null,
    arrival_airport     char(9) not null,
    departure_datetime  DATETIME,
    arrival_datetime    DATETIME,
    airplane_id     varchar (15) not null,
    primary key (airline_id, flight_no),
    foreign key (airline_id) references Airline(airline_id),
    foreign key (departure_airport) references Airport(airport_id),
    foreign key (arrival_airport) references Airport(airport_id),
    foreign key (airplane_id) references Airplane(airplane_tail_no)
);

create table Passenger_Flight (
    passenger_id char(12) not null,
    airline_id char(15) not null,
    flight_no char(9) not null,
    travel_class enum('First', 'Business', 'Economy'),
    seat_no varchar (5),
    on_flight boolean,
    primary key (passenger_id, airline_id, flight_no),
    foreign key (passenger_id) references Passenger(passenger_id),
    foreign key (airline_id) references Flight(airline_id),
    foreign key (flight_no) references Flight(flight_no)
);

create table Crew_Member_Flight (
    pilot_id varchar(9) not null,
    airline_id char(15) not null,
    flight_no char(9) not null,
    crew_position enum('pilot', 'copilot', 'flight engineer', 'flight navigator'),
    primary key(pilot_id, airline_id, flight_no),
    foreign key (pilot_id) references Crew_Member(pilot_id),
    foreign key (airline_id) references Flight(airline_id),
    foreign key (flight_no) references Flight(flight_no)
);

create table Crew_Member (
    pilot_id            varchar(9) not null,
    employer_airline_id char(15) not null,
    first_name          varchar(25) not null,
    last_name           varchar(25) not null,
    birthdate           date not null,
    country_of_origin   varchar(100),
    passport_no         char(9) not null,
    start_date          date not null,
    end_date            date,
    primary key (pilot_id),
    foreign key (employer_airline_id) references Airline(airline_id),
    check (end_date is null or end_date >= start_date)
);


```

<hr style="height:2px;">

# Data and Schema Cleanup

## Setup

- There are several issues with the `classicmodels` schema. Two issues are:
    - Having programs or users enter country names for `customers.country` is prone to error.
    - `products.productCode` is clearly not an atomic value.
    

- The following code does the following:
    1. Creates a schema for this question
    2. Creates copies of `classicmodels.customers` and `classicmodels.products`
    3. Loads a table of [ISO country codes](https://en.wikipedia.org/wiki/List_of_ISO_3166_country_codes)

In [696]:
%%sql

drop schema if exists classicmodels_midterm;
create schema classicmodels_midterm;
use classicmodels_midterm;

create table customers as select * from classicmodels.customers;
create table products as select * from classicmodels.products;

 * mysql+pymysql://root:***@localhost
4 rows affected.
1 rows affected.
0 rows affected.
122 rows affected.
110 rows affected.

[]

In [699]:
iso_df = pandas.read_csv('./wikipedia-iso-country-codes.csv')
iso_df.to_sql('countries', schema='classicmodels_midterm', 
              con=engine, index=False, if_exists="replace")

246

In [700]:
%%sql

alter table countries
    change `English short name lower case` short_name varchar(64) null;

alter table countries
    change `Alpha-2 code` alpha_2_code char(2) null;

alter table countries
    change `Alpha-3 code` alpha_3_code char(3) not null;

alter table countries
    change `Numeric code` numeric_code smallint unsigned null;

alter table countries
    change `ISO 3166-2` iso_text char(13) null;
    
alter table countries
    add primary key (alpha_3_code);
    
select * from countries limit 10;

 * mysql+pymysql://root:***@localhost
246 rows affected.
246 rows affected.
246 rows affected.
246 rows affected.
246 rows affected.
0 rows affected.
10 rows affected.

[('Aruba', 'AW', 'ABW', 533, 'ISO 3166-2:AW'),
 ('Afghanistan', 'AF', 'AFG', 4, 'ISO 3166-2:AF'),
 ('Angola', 'AO', 'AGO', 24, 'ISO 3166-2:AO'),
 ('Anguilla', 'AI', 'AIA', 660, 'ISO 3166-2:AI'),
 ('Åland Islands', 'AX', 'ALA', 248, 'ISO 3166-2:AX'),
 ('Albania', 'AL', 'ALB', 8, 'ISO 3166-2:AL'),
 ('Andorra', 'AD', 'AND', 20, 'ISO 3166-2:AD'),
 ('Netherlands Antilles', 'AN', 'ANT', 530, 'ISO 3166-2:AN'),
 ('United Arab Emirates', 'AE', 'ARE', 784, 'ISO 3166-2:AE'),
 ('Argentina', 'AR', 'ARG', 32, 'ISO 3166-2:AR')]

## DE1

- There are four values in `customers.country` that do not appear in `countries.short_name`.
- Write a query that finds these four countries.
    - Hint: Norway should be one of these countries.

In [701]:

%%sql
select distinct customers.country from 
    customers LEFT JOIN countries on customers.country=countries.short_name
        where countries.short_name is null;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('USA',), ('Norway  ',), ('UK',), ('Russia',)]

## DE2

- `Norway` actually does appear in `countries.short_name`. The reason it appeared in DE1 is because there's a space after the name (`Norway_` instead of `Norway`).
- The mapping for the other countries is:

| customers.country | countries.short_name |
| :---: | :---: |
| USA | United States |
| UK | United Kingdom |
| Russia | Russian Federation |

- Write `update table` statements to correct the values in `customers.country` so that all the values in that attribute appear in `countries.short_name`.

In [702]:
%%sql

update customers
set country = 'Norway' where country = 'Norway  ';

update customers
set country = 'United States' where country='USA';

update customers
set country = 'United Kingdom' where country = 'UK';

update customers
set country = 'Russian Federation' where country = 'Russia';

 * mysql+pymysql://root:***@localhost
2 rows affected.
36 rows affected.
5 rows affected.
1 rows affected.

[]

## DE3

- The PK of `countries` is `alpha_3_code`. We want that as a FK in `customers`.

1. Create a column `customers.iso_code`
2. Set `customers.iso_code` as a FK that references `countries.alpha_3_code`
3. Fill `customers.iso_code` with the appropriate data based on `customers.country`
4. Drop `customers.country`
5. Create a view `customers_country` of form `(customerNumber, customerName, country, iso_code)`

Bonus point: I would ask you to create an index on `customers.iso_code`, but this is actually already done for us. When was an index created on `customers.iso_code`?

An index was created on customers.iso_code when we set it as a foreign key.

In [703]:
%%sql

alter table customers
add iso_code char(3);

alter table customers
add constraint fk_iso_code foreign key (iso_code) references countries(alpha_3_code);

update (customers join countries on customers.country=countries.short_name)
set customers.iso_code = countries.alpha_3_code;

alter table customers
drop column country;

create view customers_country as
select customerNumber, customerName, short_name as country, iso_code
from 
    customers join countries on customers.iso_code=countries.alpha_3_code;

 * mysql+pymysql://root:***@localhost
0 rows affected.
122 rows affected.
122 rows affected.
0 rows affected.
0 rows affected.

[]

## DE4

- To test your code, output a table that shows the number of customers from each country.
- You should use your `customers_country` view.
- Your table should have the following attributes:
    - `country_iso`
    - `number_of_customers`
- Order your table from greatest to least `number_of_customers`.
- Show only the first 10 rows.

In [704]:
%%sql
select iso_code as country_iso, count(*) as number_of_customers
from
    customers_country
group by iso_code
order by number_of_customers desc 
limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('USA', 36),
 ('DEU', 13),
 ('FRA', 12),
 ('ESP', 7),
 ('GBR', 5),
 ('AUS', 5),
 ('ITA', 4),
 ('NZL', 4),
 ('FIN', 3),
 ('CAN', 3)]

## DE5

- `products.productCode` appears to be 3 separate values joined by an underscore.
    - I have no idea what the values mean, but let's pretend we do know for the sake of this question.
- Write `alter table` statements to create 3 new columns: `product_code_letter`, `product_code_scale`, and `product_code_number`.
    - Choose appropriate data types. `product_code_letter` should always be a single letter.

In [705]:
%%sql

alter table products
add column product_code_letter char(1) not null;

alter table products 
add column product_code_scale varchar(15) not null;

alter table products 
add column product_code_number varchar(15) not null;

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.

[]

## DE6

- As an example, for the product code `S18_3856`, the product code letter is `S`, the product code scale is `18`, and the product code number is `3856`.
    - I know the product code scale doesn't always match `products.productScale`. Let's ignore this for now.

1. Populate `product_code_letter`, `product_code_scale`, and `product_code_number` with the appropriate values based on `productCode`.
2. Change the PK of `products` from `productCode` to `(product_code_letter, product_code_scale, product_code_number)`.
3. Drop `productCode`.

In [706]:
%%sql
/* 
Source for function locate(): https://www.javatpoint.com/locate-function-in-sql
Source for function substr(): https://www.w3schools.com/sql/func_sqlserver_substring.asp
*/

update products
set product_code_letter = substr(productCode, 1, 1);

update products
set product_code_scale = substr(productCode, 2, locate('_', productCode, 1)-2);

update products
set product_code_number = substr(productCode, locate('_', productCode, 1)+1);

alter table products
add constraint products_pk1 primary key (product_code_letter, 
                                         product_code_scale, product_code_number);

alter table products
drop column productCode;

 * mysql+pymysql://root:***@localhost
110 rows affected.
110 rows affected.
110 rows affected.
0 rows affected.
0 rows affected.

[]

## DE7

- To test your code, output a table that shows the products whose `product_code_scale` doesn't match `productScale`.
- Your table should have the following attributes:
    - `product_code_letter`
    - `product_code_scale`
    - `product_code_number`
    - `productScale`
    - `productName`
- Order your table on `productName`.

In [707]:
%%sql
select product_code_letter, product_code_scale, product_code_number, productScale, productName
from products 
where product_code_scale != substr(productScale, locate(':', productScale, 1)+1)
order by productName;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[('S', '24', '3856', '1:18', '1956 Porsche 356A Coupe'),
 ('S', '24', '4620', '1:18', '1961 Chevrolet Impala'),
 ('S', '12', '3148', '1:18', '1969 Corvair Monza'),
 ('S', '700', '2824', '1:18', '1982 Camaro Z28'),
 ('S', '700', '3167', '1:72', 'F/A 18 Hornet 1/72'),
 ('S', '18', '2581', '1:72', 'P-51-D Mustang')]

<hr style="height:2px;">

# SQL

- Use the `classicmodels` database for these questions.
- The suggestions on which tables to use are hints, not requirements.

In [708]:
%sql use classicmodels

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

## SQL1

- Write a query that produces a table of form `(productName, productLine, productVendor, totalRevenue)`.
    - Attribute names should match exactly.
    - The `totalRevenue` for a product is the sum of `quantityOrdered*priceEach` across all the rows the product appears in in `orderdetails`.
    - You should consider all orders, regardless of `orders.status`.
- Only include products with `totalRevenue` greater than $150,000.
- Order your output on `totalRevenue` descending.


- You should use the `products` and `orderdetails` tables.

In [709]:
%%sql

with one as (select productName, productLine, productVendor, 
    sum(quantityOrdered*priceEach) as totalRevenue 
from 
    products join orderdetails on products.productCode=orderdetails.productCode
    group by orderdetails.productCode)
select * from one where totalRevenue>150000
order by totalRevenue desc;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[('1992 Ferrari 360 Spider red', 'Classic Cars', 'Unimax Art Galleries', Decimal('276839.98')),
 ('2001 Ferrari Enzo', 'Classic Cars', 'Second Gear Diecast', Decimal('190755.86')),
 ('1952 Alpine Renault 1300', 'Classic Cars', 'Classic Metal Creations', Decimal('190017.96')),
 ('2003 Harley-Davidson Eagle Drag Bike', 'Motorcycles', 'Red Start Diecast', Decimal('170686.00')),
 ('1968 Ford Mustang', 'Classic Cars', 'Autoart Studio Design', Decimal('161531.48')),
 ('1969 Ford Falcon', 'Classic Cars', 'Second Gear Diecast', Decimal('152543.02'))]

## SQL2

- Write a query that produces a table of form `(productCode, productName, productVendor, customerCount)`.
    - Attribute names should match exactly.
    - `customerCount` is the number of **distinct** customers that have bought the product.
        - Note that the same customer may buy a product multiple times. This only counts as one customer in the product's `customerCount`.
    - You should consider all orders, regardless of `status`.
- Order your table from largest to smallest `customerCount`, then on `productCode` alphabetically.
- Only show the first 10 rows.


- You should use the `orders` and `orderdetails` tables.

In [710]:
%%sql
/*
select productCode, count(distinct orderNumber) as customerCount from orderdetails group by productCode 
where productCode=10261;
*/

with one as
(select productCode, count(distinct orderNumber) as customerCount 
from orderdetails
group by productCode)
select one.productCode as productCode, productName, productVendor, customerCount
from 
one join products on one.productCode=products.productCode
order by customerCount desc, one.productCode asc
limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('S18_3232', '1992 Ferrari 360 Spider red', 'Unimax Art Galleries', 53),
 ('S10_1678', '1969 Harley Davidson Ultimate Chopper', 'Min Lin Diecast', 28),
 ('S10_1949', '1952 Alpine Renault 1300', 'Classic Metal Creations', 28),
 ('S10_2016', '1996 Moto Guzzi 1100i', 'Highway 66 Mini Classics', 28),
 ('S10_4698', '2003 Harley-Davidson Eagle Drag Bike', 'Red Start Diecast', 28),
 ('S10_4757', '1972 Alfa Romeo GTA', 'Motor City Art Classics', 28),
 ('S10_4962', '1962 LanciaA Delta 16V', 'Second Gear Diecast', 28),
 ('S12_1666', '1958 Setra Bus', 'Welly Diecast Productions', 28),
 ('S12_2823', '2002 Suzuki XREO', 'Unimax Art Galleries', 28),
 ('S12_4473', '1957 Chevy Pickup', 'Exoto Designs', 28)]

## SQL3

- Write a query that produces a table of form `(customerName, month, year, monthlyExpenditure, creditLimit)`.
    - Attribute names should match exactly.
    - `monthlyExpenditure` is the total amount of payments made by a customer in a specific month and year based on the `payments` table.
        - Some customers have never made any payments. For these customers, `monthlyExpenditure` should be 0. `month` and `year` can be null.
- Only show rows where `monthlyExpenditure` exceeds `creditLimit` **or** the customer has never made any payments.
- Order your table on `monthlyExpenditure` descending, then on `customerName` alphabetically.
- Only show the first 10 rows.


- You should use the `payments` and `customers` tables.

In [711]:
%%sql
/*
sources:
https://learnsql.com/cookbook/how-to-get-the-year-and-the-month-from-a-date-in-mysql/
https://www.educative.io/answers/how-to-replace-null-entries-with-default-values-in-sql
*/

with one as(
    select customers.customerNumber as customerNumber, 
        customerName,
        amount,
        month(paymentDate) as month,
        year(paymentDate) as year,
        creditLimit 
    from customers left join payments on customers.customerNumber=payments.customerNumber
)
select customerName, 
        month,
        year,
        coalesce(sum(amount),0) as monthlyExpenditure,
        creditLimit
from one
group by customerName, creditLimit, month, year
having coalesce(sum(amount),0)>creditLimit or coalesce(sum(amount),0)=0
order by coalesce(sum(amount),0) desc, customerName asc
limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('Dragon Souveniers, Ltd.', 12, 2003, Decimal('105743.00'), Decimal('103800.00')),
 ('American Souvenirs Inc', None, None, Decimal('0.00'), Decimal('0.00')),
 ('ANG Resellers', None, None, Decimal('0.00'), Decimal('0.00')),
 ('Anton Designs, Ltd.', None, None, Decimal('0.00'), Decimal('0.00')),
 ('Asian Shopping Network, Co', None, None, Decimal('0.00'), Decimal('0.00')),
 ('Asian Treasures, Inc.', None, None, Decimal('0.00'), Decimal('0.00')),
 ('BG&E Collectables', None, None, Decimal('0.00'), Decimal('0.00')),
 ('Cramer Spezialitäten, Ltd', None, None, Decimal('0.00'), Decimal('0.00')),
 ('Der Hund Imports', None, None, Decimal('0.00'), Decimal('0.00')),
 ('Feuer Online Stores, Inc', None, None, Decimal('0.00'), Decimal('0.00'))]

## SQL4

- Write a query that produces a table of form `(productCode, productName, productLine, productVendor, productDescription)`.
    - Attribute names should match exactly.
- **You should only keep products that have never been ordered by a French customer.**
    - You should consider all orders, regardless of `status`.
- Order your table on `productCode`.


- You should use the `customers`, `orders`, and `orderdetails` tables.

In [712]:
%%sql
/*
Want to make a table with all french origin products
then left join products with french products on productCode
those that have null French origin products are good to go

customers: customerNumber (no duplicates), country
products: productCode, productName
orderdetails: orderNumber (duplicates), productCode
orders: orderNumber (no duplicates), customerNumber

*/

with one as (
    select 
        products.productCode,
        customers.country,
        products.productName,
        products.productLine,
        products.productVendor,
        products.productDescription
    from 
        products
    left join 
        orderdetails on products.productCode = orderdetails.productCode
    left join 
        orders on orderdetails.orderNumber = orders.orderNumber
    left join 
        customers on orders.customerNumber = customers.customerNumber
),
french as (
    select * from one where country='France'
)
select distinct
    one.productCode as productCode,
    one.productName as productName,
    one.productLine as productLine,
    one.productVendor as productVendor,
    one.productDescription as productDescription
from 
    one left join french on 
        one.productCode = french.productCode
where french.country is null
order by one.productCode;

 * mysql+pymysql://root:***@localhost
2 rows affected.

[('S18_3233', '1985 Toyota Supra', 'Classic Cars', 'Highway 66 Mini Classics', 'This model features soft rubber tires, working steering, rubber mud guards, authentic Ford logos, detailed undercarriage, opening doors and hood, removable split rear gate, full size spare mounted in bed, detailed interior with opening glove box'),
 ('S18_4027', '1970 Triumph Spitfire', 'Classic Cars', 'Min Lin Diecast', 'Features include opening and closing doors. Color: White.')]

## SQL5

- A customer can have a sales rep employee.
- Corporate is deciding which employees to give raises to.
    - A raise is given for the reason `customers` if an employee has 8 or more customers.
    - A raise is given for the reason `orders` if the total number of orders made by customers associated with an employee is 30 or greater.
        - You should consider all orders, regardless of `status`.
    - A raise is given for the reason `both` if both conditions above are true.
- Write a query that produces a table of form `(firstName, lastName, totalCustomers, totalCustomerOrders, raiseBecause)`.
    - Attribute names should match exactly.
    - `firstName` and `lastName` are for the employee.
    - `totalCustomers` is the total number of customers associated with an employee.
    - `totalCustomerOrders` is the total number of orders made by customers associated with an employee.
    - `raiseBecause` is one of `customers`, `orders`, and `both`.
- Your table should only show employees eligible for raises, i.e., `raiseBecause` should not be null.
- Order your table on `firstName`.


- You should use the `customers`, `orders`, and `employees` tables.

In [714]:
%%sql
with one as (
select customers.customerNumber as customerNumber, salesRepEmployeeNumber, orderNumber
from customers join orders on customers.customerNumber=orders.customerNumber 
order by orderNumber asc
)
select firstName, 
        lastName,
        count(distinct customerNumber) as totalCustomers, 
        count(distinct orderNumber) as totalCustomerOrders,
        CASE
            when count(distinct customerNumber) >= 8 and count(distinct orderNumber) >= 30 
                then 'both'
            when count(distinct customerNumber) >= 8 then 'customers'
            when count(distinct orderNumber) >= 30 then 'orders'
        END as raiseBecause
    from 
        one right join employees 
        on one.salesRepEmployeeNumber=employees.employeeNumber
group by employeeNumber
having raiseBecause is not null
order by firstName asc

 * mysql+pymysql://root:***@localhost
6 rows affected.

[('Barry', 'Jones', 9, 25, 'customers'),
 ('George', 'Vanauf', 8, 22, 'customers'),
 ('Gerard', 'Hernandez', 7, 43, 'orders'),
 ('Larry', 'Bott', 8, 22, 'customers'),
 ('Leslie', 'Jennings', 6, 34, 'orders'),
 ('Pamela', 'Castillo', 10, 31, 'both')]